src/Documents/ОплатаКазначеем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<Name>ОплатаКазначеем</Name>
			<BasedOn>
				<xr:Item>Document.УчастиеВМероприятии</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗадолженностьКазначея</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Мероприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Мероприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплатыВТабличнойЧасти</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Оплаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Мероприятие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Мероприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/AccumulationRegisters/ЗадолженностьКазначея.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<AccumulationRegister>
		<Properties>
			<Name>ЗадолженностьКазначея</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Мероприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Мероприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Documents/ОплатаКазначеем/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.УчастиеВМероприятии") Тогда
		// Заполнение шапки
		Мероприятие = ДанныеЗаполнения.Мероприятие;
		Сумма = ДанныеЗаполнения.Мероприятие.СтоимостьУчастия * ДанныеЗаполнения.Участники.Количество();
		ОплатыВТабличнойЧасти = Ложь;
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ЗадолженностьКазначея Расход
	Движения.ЗадолженностьКазначея.Записывать = Истина;   
	
	Если ОплатыВТабличнойЧасти Тогда
		Для Каждого СтрокаТЧ Из Оплаты Цикл
			Движение = Движения.ЗадолженностьКазначея.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Мероприятие = СтрокаТЧ.Мероприятие;
			Движение.Сумма = СтрокаТЧ.Сумма;
		КонецЦикла;
	Иначе 
		Движение = Движения.ЗадолженностьКазначея.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Мероприятие = Мероприятие;
		Движение.Сумма = Сумма;
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОплатыВТабличнойЧасти Тогда
		МассивМероприятий = ОбщегоНазначения.ПолучитьМассивУникальныхЗначенийКолонки(Оплаты, "Мероприятие");
		Мероприятие = ?(МассивМероприятий.Количество() = 1, МассивМероприятий[0], Справочники.Мероприятия.ПустаяСсылка());
		Сумма = Оплаты.Итог("Сумма");
	Иначе
		Оплаты.Очистить();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Если ОплатыВТабличнойЧасти Тогда
		ПроверяемыеРеквизиты.Добавить("Оплаты.Мероприятие");
	Иначе
		ПроверяемыеРеквизиты.Добавить("Мероприятие");
	КонецЕсли;

КонецПроцедуры
